{
  "timestamp": "2026-03-01T21:42:19.994092+00:00",
  "total_entries": 626,
  "avg_quality": 2.73,
  "recent_30_avg": 2.67,
  "high_quality_count": 3,
  "low_quality_count": 0,
  "topic_averages": {
    "Camel Finance: Hyperwave Theory - Real-World Examples of Hyperwaves": 3.6,
    "Camel Finance: Understanding Macro and Seasonal Cycles - Crude Oil (USOIL): Supply-Demand Cycles and Seasonal Flows": 3.6,
    "Camel Finance: JISA series - ep 3 - Portfolio update (bonds and silver added)": 3.6,
    "Confluence GLD: 100% — 🟢 STRONG CONFLUENCE": 3.6,
    "queue-analysis-spx": 3.6,
    "queue-research-tlt": 3.6,
    "queue-research-xagusd": 3.6,
    "queue-research-macro": 3.6,
    "queue-research-gld": 3.6,
    "queue-research-slv": 3.6,
    "queue-research-general": 3.5,
    "Camel Finance: Understanding Macro and Seasonal Cycles - Gold: Macroeconomic Cycles and Seasonal Patterns in the Yellow Metal": 3.4,
    "Camel Finance: Huge Opportunities This Year!": 3.4,
    "Camel Finance: Calling the Top of the Stock Market": 3.4,
    "queue-research-iren": 3.4,
    "queue-research-btc": 3.4,
    "Camel Finance: Hyperwave Theory - Aftermath of a Hyperwave": 3.3,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Labor Force Participation Rate": 3.2,
    "Camel Finance: Bitcoin Just Confirmed a Bear Market": 3.2,
    "Camel Finance: Bitcoin: How to find the Bottom": 3.2,
    "queue-research-xauusd": 3.2,
    "queue-research-compound-synthesis": 3.2,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Counts": 3.1,
    "Camel Finance: Cycle Trading Fundamentals - Foreword": 3.1,
    "Camel Finance: Hyperwave Theory - Introduction to Hyperwave Theory": 3.1,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Producer Price Index (PPI)": 3.1,
    "Camel Finance: Trendline Analysis - Understanding Breakout Types": 3.1,
    "Confluence NOW: -10% — 🔴 NO CONFLUENCE": 3.1,
    "treasury bonds and interest rates": 3.0,
    "camel-finance-cycle-analysis": 3.0,
    "Camel Finance: It's Free Money (Your hearing is broken)": 3.0,
    "Camel Finance: Cycle Trading Fundamentals - Confirmation Signals": 3.0,
    "Camel Finance: Hyperwave Theory - Trading Hyperwaves": 3.0,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Consumer Price Index (CPI)": 3.0,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Non-Farm Payrolls (NFP)": 3.0,
    "Camel Finance: Understanding Macro and Seasonal Cycles - Introduction": 3.0,
    "Camel Finance: Bearish Until Early March": 3.0,
    "Camel Finance: Camel Crew LIVE STREAM": 3.0,
    "Camel Finance: Kemo predicted this months ago!": 3.0,
    "Federal Reserve interest rates": 2.9,
    "Camel Finance: This is Bad": 2.9,
    "Camel Finance: This Week is Make or Break for Markets": 2.9,
    "Camel Finance: Things are Getting Worse": 2.9,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Inversion": 2.8,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Translation": 2.8,
    "Camel Finance: Cycle Trading Fundamentals - Fractalisation & Influence": 2.8,
    "Camel Finance: Cycle Trading Fundamentals - Risk Management": 2.8,
    "Camel Finance: Cycle Trading Fundamentals - Summary": 2.8,
    "Camel Finance: Cycle Trading Fundamentals - Timing Based Cycle Lows": 2.8,
    "Camel Finance: Hyperwave Theory - Primary Reference": 2.8,
    "Camel Finance: Hyperwave Theory - What Is a Hyperwave": 2.8,
    "Camel Finance: Hyperwave Theory - Conclusion": 2.8,
    "Camel Finance: Hyperwave Theory - The Seven Phases of a Hyperwave Pattern": 2.8,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Conclusion": 2.8,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Job Openings and Labor Turnover Survey (JOLTS)": 2.8,
    "Camel Finance: Tradingview Guidebook - Account Setup and Plans": 2.8,
    "Camel Finance: Tradingview Guidebook - Drawing Tools: Trendlines, Support/Resistance & More": 2.8,
    "Camel Finance: Trendline Analysis - Trendlines in Cycle Trading": 2.8,
    "Camel Finance: Trendline Analysis - Yen Carry Trade Unwind (Case Study)": 2.8,
    "Camel Finance: Trendline Analysis - Linear vs Log Scale Charts": 2.8,
    "Camel Finance: Trendline Analysis - Conclusion and Key Takeaways": 2.8,
    "Camel Finance: Trendline Analysis - Further Trendline Case Studies": 2.8,
    "Camel Finance: Trendline Analysis - Introduction to Camel’s Trendline Strategy": 2.8,
    "Camel Finance: Understanding Macro and Seasonal Cycles - Bitcoin (BTC): Crypto Cycles and Macro Confluence": 2.8,
    "Camel Finance: Understanding Macro and Seasonal Cycles - S&P 500 (SPX): Equity Market Cycles, Macro Regimes, and Seasonality": 2.8,
    "Camel Finance: Stocks: Huge Risk of Topping": 2.8,
    "Camel Finance: Simulation Day Arrives!": 2.8,
    "Camel Finance: Can Stocks Drop 80%? This Chart Says Yes !!": 2.8,
    "Camel Finance: ISM Breaking out - Does bitcoin follow?": 2.8,
    "Camel Finance: Shorting Stocks & Hoping I'm Wrong": 2.8,
    "Camel Finance: WE SHORTED THE TOP": 2.8,
    "Camel Finance: This is Concerning": 2.8,
    "longevity": 2.8,
    "treasury-auction-calendar": 2.8,
    "treasury-bonds": 2.7,
    "Camel Finance: A Risk Off Moment is Brewing!": 2.7,
    "macroalf-commentary": 2.7,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Failure": 2.6,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Terms & Definitions": 2.6,
    "Camel Finance: The Only Way Bitcoin Can Be Bullish": 2.6,
    "Camel Finance: Exactly as Expected and Sentiment Sours": 2.6,
    "Camel Finance: Cycle Trading Fundamentals - Cycle Trading Mastery Quiz": 2.5,
    "Camel Finance: Cycle Trading Fundamentals - Introduction": 2.5,
    "Camel Finance: Hyperwave Theory - How to Draw Hyperwave Trendlines": 2.5,
    "Camel Finance: Hyperwave Theory - Hyperwave Theory vs. Other Analysis Techniques": 2.5,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Unemployment Rate (U-3)": 2.5,
    "Camel Finance: Key U.S. Economic Indicators Explained (BLS Data) - Wage Growth and Average Hourly Earnings": 2.5,
    "Camel Finance: Tradingview Guidebook - Chart Setup: Candles, Timeframes & Layouts": 2.5,
    "Camel Finance: Tradingview Guidebook - Community Features & Ideas Tab": 2.5,
    "Camel Finance: Tradingview Guidebook - Key Indicators for Swing Trading": 2.5,
    "Camel Finance: Tradingview Guidebook - Publishing & Viewing Trade Ideas": 2.5,
    "Camel Finance: Tradingview Guidebook - References & Further Learning": 2.5,
    "Camel Finance: Tradingview Guidebook - Strategy Tester Basics": 2.5,
    "Camel Finance: Tradingview Guidebook - Templates, Alerts, and Watchlists": 2.5,
    "Camel Finance: Trendline Analysis - Camel’s Personal Trendline Drawing Rules": 2.5,
    "Camel Finance: Time To Short The Market?": 2.5,
    "Gold Macro Confluence Score: 6/7": 2.5,
    "ecosystem-audit": 2.5,
    "bond market outlook": 2.4,
    "Camel Finance: Hyperwave Theory - Criteria for Identifying a Hyperwave": 2.4,
    "Camel Finance: Cycle Trading Fundamentals - Nuances In Cycle Trading": 2.2,
    "Camel Finance: Tradingview Guidebook - Platform Interface Walkthrough": 2.2,
    "Camel Finance: Tradingview Guidebook - Using the Replay (Backtesting Price Action)": 2.2,
    "Camel Finance: The next move will be VIOLENT": 2.2,
    "ai-agents": 2.2,
    "self-improvement": 2.1,
    "compound-synthesis": 2.1,
    "tool-calling": 2.1,
    "Camel Finance: Hyperwave Theory - Further Context on Hyperwave Theory": 2.0,
    "fedwatch-rate-probabilities": 2.0,
    "cross-domain-associations": 2.0
  },
  "score_distribution": {
    "1-2": 0,
    "2-3": 433,
    "3-4": 190,
    "4-5": 3
  }
}